-- phpMyAdmin SQL Dump
-- version 4.6.4
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Dec 29, 2020 at 03:24 AM
-- Server version: 5.7.15-log
-- PHP Version: 5.6.26

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `notebad`
--

-- --------------------------------------------------------

--
-- Table structure for table `notebad`
--

CREATE TABLE `notebad` (
  `code` varchar(10) NOT NULL,
  `name` varchar(50) NOT NULL,
  `data` varchar(5000) NOT NULL,
  `date` varchar(50) NOT NULL,
  `fontcolor` varchar(50) NOT NULL,
  `fontstyle` varchar(50) NOT NULL,
  `pos` varchar(50) NOT NULL,
  `backgroundcolor` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `notebad`
--

INSERT INTO `notebad` (`code`, `name`, `data`, `date`, `fontcolor`, `fontstyle`, `pos`, `backgroundcolor`) VALUES
('1', 'ادخل الاسم', 'تيح برامج الويكي للزوار أن يحرروا مواضيع الموقع جماعيًا وبلغة ترميز بسيطة وباستخدام المتصفح. ما يميز مواقع الويكي بشكل عام هو سهولة إنشاء مواضيع جديدة أو تحديث مواضيع قديمة وتعديلها دون الحاجة إلى وجود رقابة توافق على إنشاء الصفحات أو تعديلها عادةً، وبعض مواقع الويكي لا تتطلب حتى تسجيل الدخول في الموقع لإنشاء أو تعديل مواضيع فيها مميزات إضافية.\n\nالوصلات المتشعبة\nتحتفظ مواقع ويكي بكل محتوياتها في قاعدة بيانات متشعبة، وتستطيع مواقع ويكي معرفة كل صفحة وكل وصلة تصل بين الصفحات، ولا يهم موقع الصفحات هنا، على المشارك في تحرير محتويات الويكي أن يجعل بعض الكلمات تعمل كوصلة وسيقوم موقع ويكي بتفعيل هذه الوصلات، إن كانت الوصلة تشير إلى صفحة موجودة سينتقل الزائر لها، وإن كانت تشير إلى صفحة غير موجودة سيظهر نموذج لإضافة محتوياتها، وعندما تنشأ الصفحة سيقوم موقع الويكي تلقائيًا بتفعيل كل وصلة تصل هذه الصفحة الجديدة وهذا جيد جدًا.\n\nتنظيم المحتويات\nلا توجد هيكلية محددة لتنظيم المحتويات في مواقع ويكي، فيمكن لأي موقع أن ينظم محتوياته بالأسلوب الذي يناسبه، عادةً لا تحوي مواقع ويكي على صفحات تنظم المحتويات إلا في مواقع ويكي الكبيرة مثل ويكيبيديا، ففي ويكيبيديا هناك صفحة رئيسية تقود الزائر إلى أقسام فرعية أو إلى المواضيع مباشرة، ويمكن الانتقال من موضوع إلى آخر دون الحاجة إلى المرور على صفحات تنظم المحتويات وتقسمها، هذه المرونة في ويكي غير متوفرة في المواقع التقليدية التي تجبر صاحب الموقع على إنشاء هيكل محدد لمحتويات الموقع قبل وضع هذه المحتويات، أما في ويكي يمكن لصاحب الموقع كتابة المحتويات ثم تنظيمها بالطريقة التي يريدها و التي تناسب.\n\nالتحكم بالتعديلات\nمواقع ويكي صممت بحيث يستطيع أي شخص أن يصحح الأخطاء بسهولة، بدلاً من التركيز على تجنب الأخطاء، لذلك مواقع ويكي تعتبر حرة تماماً ويمكن لأي شخص أن يرتكب الأخطاء، لأن هذه الأخطاء ستصحح من قبل الشخص نفسه أو من قبل أناس آخرين، وهناك خاصية متوفرة في أغلب مواقع ويكي وهي صفحة أحدث التغييرات والتي تعرض قائمة بآخر التعديلات التي أجريت على صفحات موقع ويكي، هذه القائمة توفر وظيفتين، الأولى هي عرض الصفحة قبل آخر تعديل، والثانية هي عرض الاختلاف بين الصفحة الحالية وآخر تعديل أجري عليها، بهذا الأسلوب يستطيع أي كاتب أن يعرف ماذا أضيف للموضوع في كل تعديل، ويمكن إرجاع الصفحة إلى تعديل سابق في حال أن التعديلات الأخيرة لم تكن صالحة.\n\nبعض برامج ويكي تقدم خاصية مفيدة، حيث يمكن لشخص ما أن يراقب المواضيع التي تهمه، ويمكنه رؤية التعديلات التي جرت لهذه المواضيع من خلال قائمة خاصة تسمى "قائمة مراقبتي"، فقد لا ينتبه المرء إلى أن صفحة ما عدلت لأنه لم ير التعديل في صفحة أحدث التغييرات، لكن قائمة مراقبتي تضمن أنه سيرى كل تعديل على الصفحات التي يراقبها، هذه الخاصية متوفرة في برنامج ميدياويكي الذي يستخدم لإدارة موقع ويكيبيديا .\n\nالعبث والتخريب\nطبيعة مواقع ويكي المتاحه للجميع والتي تتيح للجميع تعديل المقالات تسمح للبعض أن يعبثوا في المواضيع، وأسباب هذا التخريب كثيرة، فالبعض يعبث لمجرد العبث وتجربة الموقع، والبعض يريد حذف ما لا يوافق رأيه أو تخريب المقالات التي تخالفه الرأي، والبعض يكتب مقالات جديدة لا علاقة لها بتخصص أو توجه الموقع، قد تكون هذه المقالات دعاية له أو دعاية ضد شخص ما أو فكر معين وطبعًا كل هذا من دون أن تسجل في الموقع.\n\nالكثير من برامج ويكي تتيح لمدراء الموقع حماية الصفحات فلا يستطيع أحد تعديلها، وهذا الإجراء يتخذ في حالة المواضيع الخلافية التي يكثر تعديلها دون الوصول إلى وجهة نظر محايدة ترضي جميع الأطراف، وقد تضطر مواقع ويكي في بعض الأحيان إلى وقف الكتابة والتعديل تمامًا في كل الموقع.\n\nبشكل عام يمكن تعديل أي تخريب وإعادة الصفحات إلى ما كانت عليه قبل التخريب، لذلك من الأفضل ترك المخرب يعبث كما يشاء لأنه سيتوقف لاحقًا، بعد ذلك يمكن لأي شخص إصلاح ما عبث به المخرب، ويمكن في بعض المواقع وقف المخرب عن طريق رقم IP فلا يستطيع تخريب المقالات أو في بعض الحالات منعه تمامًا من تصفح الموقع وقراءة محتوياته.\n\nمواقع الويكي العربية\nAppointment orange.svg تعرَّف على طريقة التعامل مع هذه المسألة من أجل إزالة هذا القالب.محتوى هذه المقالة بحاجة للتحديث. فضلًا، ساعد بتحديثه ليعكس الأحداث الأخيرة وليشمل المعلومات الموثوقة المتاحة حديثاً. (أبريل 2019)\nهناك فرق واضح وكبير في مواقع الويكي العربية، حيث لا يتجاوز عددها أصابع اليد الواحدة حسب موقع ويكي إندكس، بينما يصل عدد مواقع الويكي الإنجليزية 2,800 والألمانية 400 موقع. ومن مواقع الويكي العربية ويكيبيديا، وجوريسبيديا (القانون المشارك) والمعرفة وويكي مكتبات وهي موسوعة متخصصة في علم المكتبات والمعلومات ، وويكي شيعة وهي تتحدث عن أهل البيت والصحابة والإسلام.\n\nانظر أيضًا', '2020/12/29', 'f.ColorUIResource[238,238,238', 'Arabic Typesetting,Arabic Typesetting,bold,20', 'right', '255,102,102'),
('2', 's', 'erf\nfr\nr\n\ne\n\nf', '2020/12/29', '0,51,255', 'Arial,Arial,plain,18', '-1', '51,0,51');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
